In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s1 = pd.Series({'b':3, 'd':2, 'a':1, 'c':4})

In [4]:
s1

b    3
d    2
a    1
c    4
dtype: int64

In [5]:
s1.array

<PandasArray>
[3, 2, 1, 4]
Length: 4, dtype: int64

In [6]:
s1.sort_index()

a    1
b    3
c    4
d    2
dtype: int64

In [7]:
s1

b    3
d    2
a    1
c    4
dtype: int64

In [8]:
s1[['a', 'c']]

a    1
c    4
dtype: int64

In [9]:
dict1 = {
            'ticker':['Apple', 'Google', 'Amazon', 'Tesla', 'Shell'],
            'value':[11,22,33,44,55]
        }

In [10]:
df = pd.DataFrame(dict1)

In [11]:
df

   ticker  value
0   Apple     11
1  Google     22
2  Amazon     33
3   Tesla     44
4   Shell     55

In [12]:
df = df.set_index('ticker')

In [13]:
df

        value
ticker
Apple      11
Google     22
Amazon     33
Tesla      44
Shell      55

In [16]:
df.loc['Apple', :] # this returns results with datatype not clear

value    11
Name: Apple, dtype: int64

In [17]:
df.loc[['Apple'], :] # this returns results with datatype as DataFrame

        value
ticker
Apple      11

In [ ]:
# Hence, always preferable to use lists ['Apple'] when referencing rows in .loc as in the above example

In [18]:
df

        value
ticker
Apple      11
Google     22
Amazon     33
Tesla      44
Shell      55

In [32]:
df1 = pd.DataFrame(np.random.randint(1,100,(3,4)), index=list('abc'), columns=list('pqrs'))

print(df1)

df1.loc['a'] # compare this with below

    p   q   r   s
a  63  17  68  23
b  10  45  21  91
c  10  32  82  60

p    63
q    17
r    68
s    23
Name: a, dtype: int32

In [29]:
df1.loc[['a']]

    p  q   r   s
a  18  5  39  39

In [30]:
df1.loc['a', 'p'] # compare this with below

18

In [31]:
df1.loc[['a'], ['q']]

   q
a  5

In [19]:
df.reset_index(level=0, inplace=True)

df

   ticker  value
0   Apple     11
1  Google     22
2  Amazon     33
3   Tesla     44
4   Shell     55

In [20]:
hq_series = pd.Series(['USA','Ireland','Seattle','New York','LA'], index=list('abcde'))

hq_series

a         USA
b     Ireland
c     Seattle
d    New York
e          LA
dtype: object

In [21]:
df['hq'] = hq_series

df # in this case none of the indices for values in hq_series matched with indices of df, hence 'NaN' was used in df

   ticker  value   hq
0   Apple     11  NaN
1  Google     22  NaN
2  Amazon     33  NaN
3   Tesla     44  NaN
4   Shell     55  NaN

In [22]:
# In case you want to brute-force the series to be attached to the df, irrespective of mismatched indices, see below:

In [23]:
df['hq'] = hq_series.array # brute-forcing series to fit into df

df

   ticker  value        hq
0   Apple     11       USA
1  Google     22   Ireland
2  Amazon     33   Seattle
3   Tesla     44  New York
4   Shell     55        LA

#### Split, Apply, Combine

In [33]:
df = pd.read_csv('titanic.csv')

In [34]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [35]:
grouped = df.groupby('pclass')

grouped.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True

In [36]:
grouped.mean()

,survived,age,sibsp,parch,fare,adult_male,alone
pclass,,,,,,,
1,0.629630,38.233441,0.416667,0.356481,84.154687,0.550926,0.504630
2,0.472826,29.877630,0.402174,0.380435,20.662183,0.538043,0.565217
3,0.242363,25.140620,0.615071,0.393075,13.675550,0.649695,0.659878

In [37]:
grouped['survived'].mean()

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [38]:
grouped[['survived']].mean()

        survived
pclass
1       0.629630
2       0.472826
3       0.242363

In [39]:
grouped[['age', 'fare']].mean()

              age       fare
pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

In [40]:
grouped[['age']].agg([np.mean, np.median])

              age
             mean median
pclass
1       38.233441   37.0
2       29.877630   29.0
3       25.140620   24.0

In [41]:
grouped[['fare']].agg([np.mean, np.median])

             fare
             mean   median
pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

In [42]:
grouped[['fare', 'age']].agg([np.mean, np.median])

             fare                 age
             mean   median       mean median
pclass
1       84.154687  60.2875  38.233441   37.0
2       20.662183  14.2500  29.877630   29.0
3       13.675550   8.0500  25.140620   24.0

In [43]:
grouped.agg(
            mean_age = ('age', lambda x: x.mean()),
            std_fare = ('fare', np.std)
            )

         mean_age   std_fare
pclass
1       38.233441  78.380373
2       29.877630  13.417399
3       25.140620  11.778142

In [44]:
grouped2 = df.groupby(['pclass', 'sex'])

In [45]:
grouped2.mean()

               survived        age     sibsp     parch        fare  \
pclass sex
1      female  0.968085  34.611765  0.553191  0.457447  106.125798
       male    0.368852  41.281386  0.311475  0.278689   67.226127
2      female  0.921053  28.722973  0.486842  0.605263   21.970121
       male    0.157407  30.740707  0.342593  0.222222   19.741782
3      female  0.500000  21.750000  0.895833  0.798611   16.118810
       male    0.135447  26.507589  0.498559  0.224784   12.661633

               adult_male     alone
pclass sex
1      female    0.000000  0.361702
       male      0.975410  0.614754
2      female    0.000000  0.421053
       male      0.916667  0.666667
3      female    0.000000  0.416667
       male      0.919308  0.760807

In [47]:
grouped2[['survived', 'age']].mean()

               survived        age
pclass sex
1      female  0.968085  34.611765
       male    0.368852  41.281386
2      female  0.921053  28.722973
       male    0.157407  30.740707
3      female  0.500000  21.750000
       male    0.135447  26.507589

#### Time Series

In [48]:
import datetime as dt

In [49]:
ts = pd.Timestamp('2020-05-05 18:00')

In [50]:
ts

Timestamp('2020-05-05 18:00:00')

In [51]:
type(ts)

pandas._libs.tslibs.timestamps.Timestamp

In [52]:
s1 = pd.Series(109, index=[ts])

In [53]:
s1

2020-05-05 18:00:00    109
dtype: int64

In [54]:
s1.index

DatetimeIndex(['2020-05-05 18:00:00'], dtype='datetime64[ns]', freq=None)

In [55]:
# Create a year's dates

dates = pd.date_range('2020-01-01', '2020-12-31', freq='B') # 'B' indicates Business Calendar

type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [56]:
dates[0:5]

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-06',
               '2020-01-07'],
              dtype='datetime64[ns]', freq='B')

In [57]:
ts = pd.Series(np.random.randn(len(dates)), index=[dates])

In [58]:
type(ts)

pandas.core.series.Series

In [59]:
ts.head()

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-06    0.817405
2020-01-07   -0.502653
dtype: float64

In [60]:
ts['2020-01-01']

2020-01-01   -3.975908
dtype: float64

In [61]:
ts.loc['2020-01-01']

2020-01-01   -3.975908
dtype: float64

In [62]:
ts.loc[['2020-01-01']]

2020-01-01   -3.975908
dtype: float64

In [65]:
ts.loc['2020-01-01':'2020-01-07']

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-06    0.817405
2020-01-07   -0.502653
dtype: float64

In [66]:
ts.loc['2020-01'].head() # selecting by month

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-06    0.817405
2020-01-07   -0.502653
dtype: float64

In [67]:
ts.loc['2020'].head() # selecting by year

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-06    0.817405
2020-01-07   -0.502653
dtype: float64

In [68]:
# Performing lag / lead operations on time-series

In [ ]:
# shifting by values

In [76]:
ts2 = ts.loc['2020-01'].copy()

In [77]:
type(ts)

pandas.core.series.Series

In [78]:
type(ts2)

pandas.core.series.Series

In [79]:
ts2[:5]

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-06    0.817405
2020-01-07   -0.502653
dtype: float64

In [82]:
ts2.iloc[[0, 1, 2, -2, -1]]

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-30   -1.405472
2020-01-31   -1.085213
dtype: float64

In [85]:
ts2.shift(1).iloc[[0, 1, 2, -2, -1]]

2020-01-01         NaN
2020-01-02   -3.975908
2020-01-03    1.592756
2020-01-30   -0.223787
2020-01-31   -1.405472
dtype: float64

In [86]:
ts2.shift(-1).iloc[[0, 1, 2, -2, -1]]

2020-01-01    1.592756
2020-01-02   -0.481557
2020-01-03    0.817405
2020-01-30   -1.085213
2020-01-31         NaN
dtype: float64

In [ ]:
# shifting by index

In [ ]:
ts2.tshift(2).iloc[[0, 1, 2, -2, -1]] # this is giving error

In [100]:
# re-sampling is similar to grouping

In [105]:
ts.head()

2020-01-01   -3.975908
2020-01-02    1.592756
2020-01-03   -0.481557
2020-01-06    0.817405
2020-01-07   -0.502653
dtype: float64

In [ ]:
group = ts.resample('M') # giving error

In [107]:
# rolling calculations

In [108]:
roll = ts.rolling(2) # consider every 2 rolling observations

In [109]:
roll.mean() # calculate mean

2020-01-01         NaN
2020-01-02   -1.191576
2020-01-03    0.555599
2020-01-06    0.167924
2020-01-07    0.157376
                ...
2020-12-25    0.626169
2020-12-28   -0.577985
2020-12-29   -0.264689
2020-12-30    0.731337
2020-12-31    0.965245
Length: 262, dtype: float64

In [112]:
roll.agg(['sum', 'mean'])

                 sum      mean
2020-01-01       NaN       NaN
2020-01-02 -2.383152 -1.191576
2020-01-03  1.111199  0.555599
2020-01-06  0.335848  0.167924
2020-01-07  0.314752  0.157376
...              ...       ...
2020-12-25  1.252338  0.626169
2020-12-28 -1.155971 -0.577985
2020-12-29 -0.529378 -0.264689
2020-12-30  1.462674  0.731337
2020-12-31  1.930490  0.965245

[262 rows x 2 columns]

#### Pivot Tables

In [113]:
df = pd.read_csv('titanic.csv')

In [114]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [115]:
pd.pivot_table(df, index=['pclass','sex'], values='fare')

                     fare
pclass sex
1      female  106.125798
       male     67.226127
2      female   21.970121
       male     19.741782
3      female   16.118810
       male     12.661633

In [116]:
# aggregate functions on pivot

pd.pivot_table(
                df, values='fare', index=['pclass'], columns=['sex'],
                aggfunc = lambda x: x.max()-x.mean()
                )

sex         female        male
pclass
1       406.203402  445.103073
2        43.029879   53.758218
3        53.431190   56.888367

In [117]:
pd.pivot_table(
                df, values='fare', index=['pclass'], columns=['sex'],
                aggfunc = [np.mean, np.std]
                )

              mean                   std
sex         female       male     female       male
pclass
1       106.125798  67.226127  74.259988  77.548021
2        21.970121  19.741782  10.891796  14.922235
3        16.118810  12.661633  11.690314  11.681696

In [122]:
# crosstab for categorical data

In [123]:
pd.crosstab(df['pclass'], df['sex']) # performs count

sex     female  male
pclass
1           94   122
2           76   108
3          144   347

In [133]:
pd.crosstab(df['pclass'], df['sex'], normalize=True, margins=True)

sex       female      male       All
pclass
1       0.105499  0.136925  0.242424
2       0.085297  0.121212  0.206510
3       0.161616  0.389450  0.551066
All     0.352413  0.647587  1.000000

In [131]:
pd.crosstab(df['pclass'], [df['sex'],df['survived']])

sex      female     male
survived      0   1    0   1
pclass
1             3  91   77  45
2             6  70   91  17
3            72  72  300  47